[metadata]
creation_date = "2026/07/02"
integration = []
maturity = "development"
updated_date = "2026/07/02"

[rule]
actions = []
author = ["Scott Holt"]
description = """
Detects a two-step infostealer chain: a process reads from known credential or browser data stores (Chrome/Edge Login
Data, Firefox logins, SSH keys, Windows SAM/SYSTEM hive, macOS Keychain), then makes an outbound network connection
within 5 minutes. Covers Windows, Linux, and macOS paths using generic ECS fields on logs-*.
"""
enabled = false
exceptions_list = []
false_positives = []
from = "now-9m"
index = ["logs-*"]
interval = "5m"
language = "eql"
license = "Elastic License v2"
max_signals = 100
name = "Infostealer \u2014 Credential File Access Followed by Outbound Connection"
references = []
related_integrations = []
revision = 0
risk_score = 85
risk_score_mapping = []
rule_id = "50ce574b-6375-43dd-9e43-5303974d9a10"
setup = ""
severity = "high"
severity_mapping = []
tags = ["Credential Access", "Exfiltration", "Infostealer", "Collection", "MITRE ATT&CK"]
timestamp_override = "event.ingested"
to = "now"
type = "eql"
version = 1

query = '''
sequence by process.entity_id with maxspan=5m
  [file where file.path : (
    "*\\AppData\\Local\\Google\\Chrome\\User Data\\*\\Login Data*",
    "*\\AppData\\Local\\Google\\Chrome\\User Data\\*\\Cookies*",
    "*\\AppData\\Local\\Microsoft\\Edge\\User Data\\*\\Login Data*",
    "*\\AppData\\Local\\Microsoft\\Edge\\User Data\\*\\Cookies*",
    "*\\AppData\\Roaming\\Mozilla\\Firefox\\Profiles\\*\\logins.json",
    "*\\AppData\\Roaming\\Mozilla\\Firefox\\Profiles\\*\\cookies.sqlite",
    "*\\Windows\\System32\\config\\SAM",
    "*\\Windows\\System32\\config\\SYSTEM",
    "*\\Windows\\System32\\config\\SECURITY",
    "*/.ssh/id_rsa*",
    "*/.ssh/id_ed25519*",
    "*/.ssh/id_ecdsa*",
    "*/Library/Keychains/*.keychain-db",
    "*/Library/Keychains/login.keychain-db",
    "*/.mozilla/firefox/*/logins.json",
    "*/.config/google-chrome/*/Login Data*"
  )]
  [network where network.direction : ("outbound", "egress") and
   not destination.ip : ("127.0.0.0/8", "::1", "169.254.0.0/16", "10.0.0.0/8",
                         "172.16.0.0/12", "192.168.0.0/16", "fc00::/7")]
'''


[[rule.required_fields]]
ecs = true
name = "destination.ip"
type = "ip"

[[rule.required_fields]]
ecs = true
name = "file.path"
type = "keyword"

[[rule.required_fields]]
ecs = true
name = "network.direction"
type = "keyword"

[[rule.required_fields]]
ecs = true
name = "process.entity_id"
type = "keyword"

[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1555"
name = "Credentials from Password Stores"
reference = "https://attack.mitre.org/techniques/T1555/"
[[rule.threat.technique.subtechnique]]
id = "T1555.003"
name = "Credentials from Web Browsers"
reference = "https://attack.mitre.org/techniques/T1555/003/"



[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1539"
name = "Steal Web Session Cookie"
reference = "https://attack.mitre.org/techniques/T1539/"


[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1041"
name = "Exfiltration Over C2 Channel"
reference = "https://attack.mitre.org/techniques/T1041/"


[rule.threat.tactic]
id = "TA0010"
name = "Exfiltration"
reference = "https://attack.mitre.org/tactics/TA0010/"

